Confinement_Study/Steady/slip_Case/0/cMinus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      C2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    bottom
    {
        //type            fixedIonicFlux;
	type            zeroIonicFlux_nonD;
	zib		-1;        
	value           uniform 1;
    }
    top
    {
        type            fixedValue;
        value           uniform 1;
    }
/*
    periodic
    {
	type            cyclic;// zeroGradient;
    }

    periodic2
    {
	type            cyclic;// zeroGradient;
    }
*/

    wall
    {
	type            zeroGradient;
    }  
}


// ************************************************************************* //
