Confinement_Study/Steady/slip_Case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    top
    {
        type            patch;
        nFaces          3480;
        startFace       305340;
    }
    bottom
    {
        type            patch;
        nFaces          3480;
        startFace       308820;
    }
    wall
    {
        type            patch;
        nFaces          8760;
        startFace       312300;
    }
)


// ************************************************************************* //
